; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared5 - mode
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	thermograph4 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	GroundStation12 - direction
	GroundStation9 - direction
	GroundStation13 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 image1)
	(supports instrument1 infrared5)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 infrared5)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation12)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation12)
)
(:goal (and
	(pointing satellite1 Planet14)
	(have_image Planet14 thermograph2)
	(have_image Star15 thermograph3)
	(have_image Phenomenon16 thermograph4)
	(have_image Phenomenon16 image1)
	(have_image Phenomenon17 thermograph4)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 groundstation12)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 planet14 groundstation12)
   deleted: (pointing satellite1 groundstation12)
   added: (pointing satellite1 planet14)
   goals met: 1 of 6
5. (take_image satellite1 planet14 instrument2 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 2 of 6
6. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 6
7. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon16 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon16 instrument1 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 6
10. (take_image satellite0 phenomenon16 instrument1 thermograph4)
   added: (have_image phenomenon16 thermograph4)
   goals met: 4 of 6
11. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 4 of 6
12. (take_image satellite0 phenomenon17 instrument1 thermograph4)
   added: (have_image phenomenon17 thermograph4)
   goals met: 5 of 6
13. (turn_to satellite1 star15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star15)
   goals met: 4 of 6
14. (take_image satellite1 star15 instrument2 thermograph3)
   added: (have_image star15 thermograph3)
   goals met: 5 of 6
15. (turn_to satellite1 planet14 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet14)
   goals met: 6 of 6
